'''Какие шаги ты бы предпринял, если бы пользователь сказал, что API возвращает ему ошибку 500? 

Код ответа сервера 500 Internal Server Error указывает на то, что сервер столкнулся c неожиданной ошибкой, которая помешала ему выполнить запрос.
Код ошибки 5xx говорит о том, что браузер отправил запрос корректно, но сервер не смог его обработать.

Что можно порекомендовать сделать пользователю:
	- перезагрузить страницу
	- очистить кэш и coockies непосредственно самой страницы или польностью браузера

Со стороны разработчика я бы изучил логи, чтобы понять, в какой конкретно момент происходит ошибка.'''
